---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterFilterRuleFactory
source: html/f17be87a-a682-5fcc-8ebc-1449952461ff.htm
---
# ParameterFilterRuleFactory Methods

Creates a filter rule that determines whether strings from the document
 begin with a certain string value.